----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrew/Desktop/PS2 Stata log.log
  log type:  text
 opened on:  30 Sep 2013, 22:19:32

. * Load data and start this thing

. clear

. cd "~/Documents/Duke 2013-2014/Fall 2013/PubPol 604/Problem set 2/"
/Users/andrew/Documents/Duke 2013-2014/Fall 2013/PubPol 604/Problem set 2

. *-------------

. * Question 1

. *-------------

. * Quasi-experiment with no control group and no pre-test, looking at 2006 data

. use PS2.dta if year == 2006 & everevac == 1, clear

. 
. * Weeks worked last year

. mean wkswork

Mean estimation                     Number of obs    =     386

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     wkswork |   33.56736   1.148759      31.30873    35.82598
--------------------------------------------------------------

. 
. * Earnings

. mean earnings

Mean estimation                     Number of obs    =     386

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
    earnings |    22586.2   1310.931      20008.72    25163.68
--------------------------------------------------------------

. 
. * Unemployment compensation

. mean unempinc

Mean estimation                     Number of obs    =     386

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
    unempinc |   128.8161   33.21645      63.50772    194.1244
--------------------------------------------------------------

. 
. * Health status

. tabulate health

     health |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        103       26.68       26.68
          2 |        111       28.76       55.44
          3 |        101       26.17       81.61
          4 |         50       12.95       94.56
          5 |         21        5.44      100.00
------------+-----------------------------------
      Total |        386      100.00

. 
. 
. *-------------

. * Question 2

. *-------------

. * Pre-evaluation outcomes compared to post-evacuation outcomes

. use PS2.dta if everevac == 1, clear

. 
. * Weeks worked last year

. oneway wkswork year

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      967.407436      1   967.407436      1.90     0.1687
 Within groups      327652.633    643   509.568636
------------------------------------------------------------------------
    Total            328620.04    644   510.279566

Bartlett's test for equal variances:  chi2(1) =   0.0001  Prob>chi2 = 0.994

. ttest wkswork, by(year)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
    2005 |     259    36.06564    1.403037    22.57974    33.30278     38.8285
    2006 |     386    33.56736    1.148759    22.56953    31.30873    35.82598
---------+--------------------------------------------------------------------
combined |     645    34.57054    .8894555    22.58937    32.82396    36.31713
---------+--------------------------------------------------------------------
    diff |             2.49828    1.813166               -1.062163    6.058722
------------------------------------------------------------------------------
    diff = mean(2005) - mean(2006)                                t =   1.3779
Ho: diff = 0                                     degrees of freedom =      643

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9156         Pr(|T| > |t|) = 0.1687          Pr(T > t) = 0.0844

. 
. * Earnings

. oneway earnings year

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups       162303030      1    162303030      0.18     0.6686
 Within groups      5.6887e+11    643    884709411
------------------------------------------------------------------------
    Total           5.6903e+11    644    883587662

Bartlett's test for equal variances:  chi2(1) =  28.9592  Prob>chi2 = 0.000

. ttest earnings, by(year) unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
    2005 |     259    23609.49     2165.92    34857.18    19344.36    27874.63
    2006 |     386     22586.2    1310.931    25755.71    20008.72    25163.68
---------+--------------------------------------------------------------------
combined |     645    22997.11    1170.429     29725.2    20698.79    25295.42
---------+--------------------------------------------------------------------
    diff |            1023.292    2531.748                -3952.47    5999.055
------------------------------------------------------------------------------
    diff = mean(2005) - mean(2006)                                t =   0.4042
Ho: diff = 0                     Satterthwaite's degrees of freedom =  441.909

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6569         Pr(|T| > |t|) = 0.6863          Pr(T > t) = 0.3431

. 
. * Unemployment compensation

. oneway unempinc year

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups       1308755.1      1    1308755.1      4.46     0.0351
 Within groups       188737584    643   293526.569
------------------------------------------------------------------------
    Total            190046339    644    295103.01

Bartlett's test for equal variances:  chi2(1) = 144.7750  Prob>chi2 = 0.000

. ttest unempinc, by(year) unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
    2005 |     259    36.92664    19.25375    309.8597    -.987861    74.84114
    2006 |     386    128.8161    33.21645    652.5996    63.50772    194.1244
---------+--------------------------------------------------------------------
combined |     645    91.91783    21.38981    543.2338    49.91563      133.92
---------+--------------------------------------------------------------------
    diff |           -91.88942    38.39322               -167.2939   -16.48492
------------------------------------------------------------------------------
    diff = mean(2005) - mean(2006)                                t =  -2.3934
Ho: diff = 0                     Satterthwaite's degrees of freedom =  588.103

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0085         Pr(|T| > |t|) = 0.0170          Pr(T > t) = 0.9915

. 
. * Health status

. tabulate health year, chi2 column

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         year
    health |      2005       2006 |     Total
-----------+----------------------+----------
         1 |        56        103 |       159 
           |     21.62      26.68 |     24.65 
-----------+----------------------+----------
         2 |        80        111 |       191 
           |     30.89      28.76 |     29.61 
-----------+----------------------+----------
         3 |        75        101 |       176 
           |     28.96      26.17 |     27.29 
-----------+----------------------+----------
         4 |        31         50 |        81 
           |     11.97      12.95 |     12.56 
-----------+----------------------+----------
         5 |        17         21 |        38 
           |      6.56       5.44 |      5.89 
-----------+----------------------+----------
     Total |       259        386 |       645 
           |    100.00     100.00 |    100.00 

          Pearson chi2(4) =   2.7434   Pr = 0.602

. * spineplot health year

. 
. * Regressions

. regress wkswork year age black sex hsgrad someco ba postgrad, robust

Linear regression                                      Number of obs =     645
                                                       F(  8,   636) =   10.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1053
                                                       Root MSE      =  21.501

------------------------------------------------------------------------------
             |               Robust
     wkswork |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |  -2.336691   1.729203    -1.35   0.177    -5.732328    1.058946
         age |  -.1566087   .0747393    -2.10   0.037    -.3033743   -.0098431
       black |  -4.491843   1.997865    -2.25   0.025    -8.415053   -.5686338
         sex |  -7.727117    1.72557    -4.48   0.000    -11.11562   -4.338613
      hsgrad |   6.616299   2.885523     2.29   0.022      .949994     12.2826
      someco |   6.426472    2.12501     3.02   0.003     2.253587    10.59936
          ba |  -.8073707   2.716992    -0.30   0.766    -6.142731     4.52799
    postgrad |   4.507395   3.242692     1.39   0.165    -1.860282    10.87507
       _cons |   4732.308   3467.972     1.36   0.173    -2077.751    11542.37
------------------------------------------------------------------------------

. regress earnings year age black sex hsgrad someco ba postgrad, robust

Linear regression                                      Number of obs =     645
                                                       F(  8,   636) =   13.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2184
                                                       Root MSE      =   26444

------------------------------------------------------------------------------
             |               Robust
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |  -1783.606   2375.196    -0.75   0.453    -6447.781    2880.569
         age |  -146.8074   95.73007    -1.53   0.126    -334.7926    41.17783
       black |  -2397.509   1732.053    -1.38   0.167    -5798.743    1003.724
         sex |  -13940.65   2281.671    -6.11   0.000    -18421.17   -9460.128
      hsgrad |   4934.234   1970.417     2.50   0.013     1064.924    8803.544
      someco |    6362.53   2189.071     2.91   0.004      2063.85    10661.21
          ba |   6001.959   3121.825     1.92   0.055    -128.3714    12132.29
    postgrad |   28001.18   8608.237     3.25   0.001     11097.17    44905.18
       _cons |    3617925    4766824     0.76   0.448     -5742692    1.30e+07
------------------------------------------------------------------------------

. regress unempinc year age black sex hsgrad someco ba postgrad, robust

Linear regression                                      Number of obs =     645
                                                       F(  8,   636) =    1.48
                                                       Prob > F      =  0.1621
                                                       R-squared     =  0.0216
                                                       Root MSE      =   540.7

------------------------------------------------------------------------------
             |               Robust
    unempinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |   98.68047   38.56708     2.56   0.011     22.94625    174.4147
         age |  -2.332504   1.568024    -1.49   0.137    -5.411633    .7466256
       black |   89.07424   62.86779     1.42   0.157     -34.3793    212.5278
         sex |   2.140977   36.12803     0.06   0.953    -68.80367    73.08562
      hsgrad |   44.03501   49.68678     0.89   0.376    -53.53498     141.605
      someco |   75.84063   57.71849     1.31   0.189    -37.50122    189.1825
          ba |  -28.70364   102.6749    -0.28   0.780    -230.3264    172.9192
    postgrad |  -86.68091   85.25966    -1.02   0.310    -254.1054    80.74357
       _cons |  -197808.4   77312.99    -2.56   0.011      -349628   -45988.81
------------------------------------------------------------------------------

. ologit health year age black sex hsgrad someco ba postgrad, robust

Iteration 0:   log pseudolikelihood = -959.34262  
Iteration 1:   log pseudolikelihood = -908.22185  
Iteration 2:   log pseudolikelihood = -907.59551  
Iteration 3:   log pseudolikelihood = -907.59465  
Iteration 4:   log pseudolikelihood = -907.59465  

Ordered logistic regression                       Number of obs   =        645
                                                  Wald chi2(8)    =      95.71
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -907.59465                 Pseudo R2       =     0.0539

------------------------------------------------------------------------------
             |               Robust
      health |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |  -.1551851   .1463731    -1.06   0.289    -.4420712     .131701
         age |   .0494337   .0061634     8.02   0.000     .0373537    .0615137
       black |   .4821792   .1684259     2.86   0.004     .1520706    .8122878
         sex |   .1887714   .1496994     1.26   0.207     -.104634    .4821768
      hsgrad |   -.341207   .2622308    -1.30   0.193      -.85517     .172756
      someco |   .1217098   .1745494     0.70   0.486    -.2204007    .4638204
          ba |  -.9426108   .2396012    -3.93   0.000     -1.41222   -.4730012
    postgrad |  -.1312706   .3262619    -0.40   0.687    -.7707322    .5081909
-------------+----------------------------------------------------------------
       /cut1 |  -310.3107   293.5577                     -885.6731    265.0518
       /cut2 |  -308.8751   293.5547                     -884.2318    266.4816
       /cut3 |   -307.408   293.5508                     -882.7571     267.941
       /cut4 |  -306.0365   293.5539                     -881.3916    269.3186
------------------------------------------------------------------------------

. 
. * Cheat and use graphics from R.

. * There's no way I'm spending hours figuring out how to program Monte Carlo

. * simulations of predicted ologit probabilities in Stata... R is better for

. * that anyway :)

. 
. 
. *-------------

. * Question 3

. *-------------

. * Non-evacuees as control, using March 2006 data

. use PS2.dta if year == 2006, clear

. 
. * Weeks worked last year

. oneway wkswork everevac

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      11140.6893      1   11140.6893     25.35     0.0000
 Within groups      32230128.5  73341    439.45581
------------------------------------------------------------------------
    Total           32241269.2  73342   439.601718

Bartlett's test for equal variances:  chi2(1) =   4.4338  Prob>chi2 = 0.035

. ttest wkswork, by(everevac) unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   72957    38.95388    .0775786     20.9544    38.80182    39.10593
       1 |     386    33.56736    1.148759    22.56953    31.30873    35.82598
---------+--------------------------------------------------------------------
combined |   73343    38.92553    .0774195    20.96668    38.77379    39.07727
---------+--------------------------------------------------------------------
    diff |            5.386519    1.151375                3.122813    7.650226
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   4.6783
Ho: diff = 0                     Satterthwaite's degrees of freedom =   388.52

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. * Earnings

. oneway earnings everevac

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      3.6730e+10      1   3.6730e+10     18.05     0.0000
 Within groups      1.4926e+14  73341   2.0352e+09
------------------------------------------------------------------------
    Total           1.4930e+14  73342   2.0357e+09

Bartlett's test for equal variances:  chi2(1) = 172.3970  Prob>chi2 = 0.000

. ttest earnings, by(everevac) unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   72957     32366.7    167.3171    45193.27    32038.76    32694.64
       1 |     386     22586.2    1310.931    25755.71    20008.72    25163.68
---------+--------------------------------------------------------------------
combined |   73343    32315.23    166.5996    45118.35    31988.69    32641.76
---------+--------------------------------------------------------------------
    diff |            9780.501    1321.565                7182.372    12378.63
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   7.4007
Ho: diff = 0                     Satterthwaite's degrees of freedom =  397.645

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. * Unemployment compensation

. oneway unempinc everevac

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups       .15196228      1    .15196228      0.00     0.9997
 Within groups      9.0206e+10  73341   1229947.34
------------------------------------------------------------------------
    Total           9.0206e+10  73342   1229930.57

Bartlett's test for equal variances:  chi2(1) = 156.9223  Prob>chi2 = 0.000

. ttest unempinc, by(everevac) unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |   72957    128.7962     4.11299    1110.941    120.7347    136.8576
       1 |     386    128.8161    33.21645    652.5996    63.50772    194.1244
---------+--------------------------------------------------------------------
combined |   73343    128.7963    4.095067    1109.022      120.77    136.8226
---------+--------------------------------------------------------------------
    diff |           -.0198946    33.47012               -65.82078    65.78099
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.0006
Ho: diff = 0                     Satterthwaite's degrees of freedom =  396.896

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.4998         Pr(|T| > |t|) = 0.9995          Pr(T > t) = 0.5002

. 
. * Health status

. tabulate health everevac, chi2 column cchi2

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| chi2 contribution |
| column percentage |
+-------------------+

           |       everevac
    health |         0          1 |     Total
-----------+----------------------+----------
         1 |    20,614        103 |    20,717 
           |       0.0        0.3 |       0.3 
           |     28.25      26.68 |     28.25 
-----------+----------------------+----------
         2 |    24,963        111 |    25,074 
           |       0.0        3.3 |       3.3 
           |     34.22      28.76 |     34.19 
-----------+----------------------+----------
         3 |    18,741        101 |    18,842 
           |       0.0        0.0 |       0.0 
           |     25.69      26.17 |     25.69 
-----------+----------------------+----------
         4 |     6,003         50 |     6,053 
           |       0.1       10.3 |      10.4 
           |      8.23      12.95 |      8.25 
-----------+----------------------+----------
         5 |     2,636         21 |     2,657 
           |       0.0        3.5 |       3.5 
           |      3.61       5.44 |      3.62 
-----------+----------------------+----------
     Total |    72,957        386 |    73,343 
           |       0.1       17.6 |      17.6 
           |    100.00     100.00 |    100.00 

          Pearson chi2(4) =  17.6445   Pr = 0.001

. * spineplot health everevac

. 
. regress wkswork everevac age black sex hsgrad someco ba postgrad

      Source |       SS       df       MS              Number of obs =   73343
-------------+------------------------------           F(  8, 73334) =  888.45
       Model |  2848749.75     8  356093.719           Prob > F      =  0.0000
    Residual |  29392519.5 73334   400.80344           R-squared     =  0.0884
-------------+------------------------------           Adj R-squared =  0.0883
       Total |  32241269.2 73342  439.601718           Root MSE      =   20.02

------------------------------------------------------------------------------
     wkswork |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    everevac |  -3.996255   1.023018    -3.91   0.000    -6.001366   -1.991143
         age |  -.2438114   .0066384   -36.73   0.000    -.2568226   -.2308001
       black |  -1.347095   .2556718    -5.27   0.000    -1.848211   -.8459793
         sex |  -7.787478   .1482812   -52.52   0.000    -8.078109   -7.496847
      hsgrad |   8.642483   .2595007    33.30   0.000     8.133863    9.151104
      someco |   2.613296   .1931787    13.53   0.000     2.234666    2.991926
          ba |   1.874704   .2173752     8.62   0.000      1.44865    2.300759
    postgrad |   1.614527   .2852517     5.66   0.000     1.055435    2.173619
       _cons |   51.75797   .4292108   120.59   0.000     50.91672    52.59922
------------------------------------------------------------------------------

. regress earnings everevac age black sex hsgrad someco ba postgrad

      Source |       SS       df       MS              Number of obs =   73343
-------------+------------------------------           F(  8, 73334) = 1629.43
       Model |  2.2533e+13     8  2.8167e+12           Prob > F      =  0.0000
    Residual |  1.2677e+14 73334  1.7286e+09           R-squared     =  0.1509
-------------+------------------------------           Adj R-squared =  0.1508
       Total |  1.4930e+14 73342  2.0357e+09           Root MSE      =   41577

------------------------------------------------------------------------------
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    everevac |  -6387.017   2124.551    -3.01   0.003    -10551.13   -2222.905
         age |   3.500383   13.78631     0.25   0.800    -23.52073     30.5215
       black |  -2895.401   530.9659    -5.45   0.000    -3936.092    -1854.71
         sex |  -19407.87   307.9428   -63.02   0.000    -20011.43    -18804.3
      hsgrad |   9912.908   538.9176    18.39   0.000     8856.631    10969.18
      someco |   7060.417   401.1836    17.60   0.000     6274.099    7846.735
          ba |   15197.09   451.4336    33.66   0.000     14312.29     16081.9
    postgrad |   19452.69   592.3959    32.84   0.000     18291.59    20613.78
       _cons |   42447.64   891.3628    47.62   0.000     40700.58    44194.71
------------------------------------------------------------------------------

. regress unempinc everevac age black sex hsgrad someco ba postgrad

      Source |       SS       df       MS              Number of obs =   73343
-------------+------------------------------           F(  8, 73334) =   12.55
       Model |   123352211     8  15419026.3           Prob > F      =  0.0000
    Residual |  9.0082e+10 73334  1228382.69           R-squared     =  0.0014
-------------+------------------------------           Adj R-squared =  0.0013
       Total |  9.0206e+10 73342  1229930.57           Root MSE      =  1108.3

------------------------------------------------------------------------------
    unempinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    everevac |  -4.452544   56.63494    -0.08   0.937    -115.4568    106.5517
         age |  -.1709383   .3675067    -0.47   0.642    -.8912501    .5493735
       black |   31.00089   14.15415     2.19   0.029     3.258803    58.74298
         sex |  -62.91479   8.208944    -7.66   0.000    -79.00429   -46.82529
      hsgrad |   20.04842   14.36613     1.40   0.163    -8.109132    48.20597
      someco |   6.015748    10.6945     0.56   0.574    -14.94543    26.97693
          ba |  -48.77581   12.03403    -4.05   0.000    -72.36246   -25.18915
    postgrad |  -25.66471   15.79172    -1.63   0.104    -56.61642    5.286991
       _cons |     224.98   23.76139     9.47   0.000     178.4078    271.5523
------------------------------------------------------------------------------

. ologit health everevac age black sex hsgrad someco ba postgrad

Iteration 0:   log likelihood = -102625.54  
Iteration 1:   log likelihood = -98294.017  
Iteration 2:   log likelihood = -98257.079  
Iteration 3:   log likelihood = -98257.048  
Iteration 4:   log likelihood = -98257.048  

Ordered logistic regression                       Number of obs   =      73343
                                                  LR chi2(8)      =    8736.98
                                                  Prob > chi2     =     0.0000
Log likelihood = -98257.048                       Pseudo R2       =     0.0426

------------------------------------------------------------------------------
      health |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    everevac |    .086199   .0954273     0.90   0.366    -.1008351    .2732332
         age |   .0361537   .0006186    58.45   0.000     .0349414    .0373661
       black |    .441045   .0233114    18.92   0.000     .3953556    .4867345
         sex |   .1025354   .0135346     7.58   0.000     .0760081    .1290627
      hsgrad |  -.6085805   .0239078   -25.46   0.000    -.6554389   -.5617221
      someco |  -.3347559   .0175831   -19.04   0.000    -.3692182   -.3002935
          ba |   -.497493   .0199007   -25.00   0.000    -.5364976   -.4584885
    postgrad |  -.2318399    .026275    -8.82   0.000     -.283338   -.1803418
-------------+----------------------------------------------------------------
       /cut1 |  -.1411335   .0393032                     -.2181664   -.0641006
       /cut2 |   1.424534   .0396672                      1.346787     1.50228
       /cut3 |   3.037188    .040923                      2.956981    3.117396
       /cut4 |   4.366316    .044123                      4.279836    4.452795
------------------------------------------------------------------------------

. 
. * Use R graphics again :)

. 
. 
. *-------------

. * Question 4

. *-------------

. use PS2.dta, clear

. 
. * Two groups: evacuees, non-evacuees (everevac)

. * Two times: 2005, 2006

. recode year (2005 = 0) (2006 = 1), gen(after_storm)
(110011 differences between year and after_storm)

. gen interaction = after_storm*everevac

. 
. * Simple models

. regress wkswork after_storm everevac interaction, robust

Linear regression                                      Number of obs =  110011
                                                       F(  3,110007) =   17.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0005
                                                       Root MSE      =  21.111

------------------------------------------------------------------------------
             |               Robust
     wkswork |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |   .7158863   .1363453     5.25   0.000     .4486515    .9831212
    everevac |  -2.172354   1.404832    -1.55   0.122    -4.925805    .5810976
 interaction |  -3.214166   1.815447    -1.77   0.077    -6.772416    .3440845
       _cons |   38.23799   .1121226   341.04   0.000     38.01823    38.45775
------------------------------------------------------------------------------

. regress earnings after_storm everevac interaction, robust

Linear regression                                      Number of obs =  110011
                                                       F(  3,110007) =   26.92
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0004
                                                       Root MSE      =   44887

------------------------------------------------------------------------------
             |               Robust
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |   1116.547   286.9962     3.89   0.000     554.0381    1679.055
    everevac |  -7640.662   2174.313    -3.51   0.000    -11902.28    -3379.04
 interaction |  -2139.839   2543.577    -0.84   0.400    -7125.212    2845.535
       _cons |   31250.16   233.1763   134.02   0.000     30793.13    31707.18
------------------------------------------------------------------------------

. regress unempinc after_storm everevac interaction, robust

Linear regression                                      Number of obs =  110011
                                                       F(  3,110007) =    9.16
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0000
                                                       Root MSE      =  1161.5

------------------------------------------------------------------------------
             |               Robust
    unempinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |  -14.34671   7.798086    -1.84   0.066    -29.63084    .9374263
    everevac |  -106.2162   20.32688    -5.23   0.000    -146.0566   -66.37585
 interaction |   106.2361   39.12305     2.72   0.007     29.55552    182.9167
       _cons |   143.1429   6.625185    21.61   0.000     130.1576    156.1281
------------------------------------------------------------------------------

. ologit health after_storm everevac interaction, robust

Iteration 0:   log pseudolikelihood =  -154284.5  
Iteration 1:   log pseudolikelihood = -154270.63  
Iteration 2:   log pseudolikelihood = -154270.63  

Ordered logistic regression                       Number of obs   =     110011
                                                  Wald chi2(3)    =      25.80
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -154270.63                 Pseudo R2       =     0.0001

------------------------------------------------------------------------------
             |               Robust
      health |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |  -.0316404   .0116057    -2.73   0.006    -.0543871   -.0088937
    everevac |   .3913771   .1174065     3.33   0.001     .1612646    .6214896
 interaction |  -.1294995   .1559546    -0.83   0.406    -.4351649     .176166
-------------+----------------------------------------------------------------
       /cut1 |  -.9595172   .0102933                     -.9796917   -.9393426
       /cut2 |   .4770631   .0099551                      .4575515    .4965748
       /cut3 |   1.965644   .0120857                      1.941956    1.989331
       /cut4 |   3.248834   .0177956                      3.213955    3.283713
------------------------------------------------------------------------------

. 
. * With controls

. regress wkswork after_storm everevac interaction age black sex hsgrad someco ba postgrad, ro
> bust

Linear regression                                      Number of obs =  110011
                                                       F( 10,110000) = 1103.11
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0921
                                                       Root MSE      =  20.121

------------------------------------------------------------------------------
             |               Robust
     wkswork |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |   .5744916   .1296856     4.43   0.000     .3203096    .8286736
    everevac |  -1.400258    1.34057    -1.04   0.296    -4.027757     1.22724
 interaction |  -2.568671   1.732168    -1.48   0.138    -5.963695    .8263536
         age |  -.2732227   .0058573   -46.65   0.000     -.284703   -.2617424
       black |  -1.452721    .223824    -6.49   0.000    -1.891413   -1.014029
         sex |  -7.722902   .1209461   -63.85   0.000    -7.959955   -7.485849
      hsgrad |   8.692401   .2382379    36.49   0.000     8.225458    9.159344
      someco |   2.741357   .1614714    16.98   0.000     2.424876    3.057839
          ba |   1.692921   .1676399    10.10   0.000     1.364349    2.021493
    postgrad |   1.600875   .2051824     7.80   0.000      1.19872    2.003029
       _cons |   52.33543   .3704759   141.27   0.000      51.6093    53.06156
------------------------------------------------------------------------------

. regress earnings after_storm everevac interaction age black sex hsgrad someco ba postgrad, r
> obust

Linear regression                                      Number of obs =  110011
                                                       F( 10,110000) = 1284.79
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1490
                                                       Root MSE      =   41417

------------------------------------------------------------------------------
             |               Robust
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |   827.4975    265.085     3.12   0.002     307.9348     1347.06
    everevac |  -3799.238   1952.132    -1.95   0.052    -7625.389    26.91327
 interaction |  -2554.218   2286.768    -1.12   0.264     -7036.25    1927.814
         age |  -21.37784   10.22355    -2.09   0.037    -41.41584   -1.339831
       black |  -3224.639   305.3497   -10.56   0.000     -3823.12   -2626.158
         sex |  -19242.02    253.225   -75.99   0.000    -19738.34    -18745.7
      hsgrad |   9887.709   246.0677    40.18   0.000      9405.42       10370
      someco |   6925.844   237.4627    29.17   0.000      6460.42    7391.267
          ba |   14909.54   398.5048    37.41   0.000     14128.48     15690.6
    postgrad |   19277.15    807.102    23.88   0.000     17695.24    20859.06
       _cons |   42705.84   608.2615    70.21   0.000     41513.66    43898.02
------------------------------------------------------------------------------

. regress unempinc after_storm everevac interaction age black sex hsgrad someco ba postgrad, r
> obust

Linear regression                                      Number of obs =  110011
                                                       F( 10,110000) =   16.19
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0016
                                                       Root MSE      =  1160.7

------------------------------------------------------------------------------
             |               Robust
    unempinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |  -14.23173   7.781521    -1.83   0.067     -29.4834    1.019934
    everevac |  -119.1227   20.91384    -5.70   0.000    -160.1135   -78.13183
 interaction |   114.3962   39.15469     2.92   0.003     37.65359    191.1388
         age |  -.1871804    .302998    -0.62   0.537     -.781052    .4066913
       black |    36.2433   15.19077     2.39   0.017     6.469601    66.01699
         sex |  -73.00615    7.18445   -10.16   0.000    -87.08757   -58.92473
      hsgrad |   17.13776   12.88848     1.33   0.184    -8.123479      42.399
      someco |   14.29051    9.64441     1.48   0.138    -4.612396    33.19341
          ba |  -54.53945   9.856954    -5.53   0.000    -73.85893   -35.21996
    postgrad |  -23.61153   11.85193    -1.99   0.046    -46.84114   -.3819312
       _cons |   254.0818   20.29871    12.52   0.000     214.2966    293.8669
------------------------------------------------------------------------------

. ologit health after_storm everevac interaction age black sex hsgrad someco ba postgrad, robu
> st

Iteration 0:   log pseudolikelihood =  -154284.5  
Iteration 1:   log pseudolikelihood = -147582.34  
Iteration 2:   log pseudolikelihood = -147521.76  
Iteration 3:   log pseudolikelihood =  -147521.7  
Iteration 4:   log pseudolikelihood =  -147521.7  

Ordered logistic regression                       Number of obs   =     110011
                                                  Wald chi2(10)   =   12758.16
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood =  -147521.7                 Pseudo R2       =     0.0438

------------------------------------------------------------------------------
             |               Robust
      health |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 after_storm |  -.0158109   .0117671    -1.34   0.179     -.038874    .0072522
    everevac |    .248562   .1142187     2.18   0.030     .0246974    .4724266
 interaction |  -.1638154   .1543397    -1.06   0.289    -.4663157    .1386848
         age |   .0366051   .0005053    72.45   0.000     .0356148    .0375953
       black |   .4461462   .0194621    22.92   0.000     .4080012    .4842912
         sex |   .0980796   .0110933     8.84   0.000     .0763372    .1198219
      hsgrad |  -.6539265   .0203577   -32.12   0.000    -.6938267   -.6140262
      someco |  -.3227572   .0144475   -22.34   0.000    -.3510737   -.2944407
          ba |  -.4932061   .0160196   -30.79   0.000     -.524604   -.4618082
    postgrad |   -.240135   .0211392   -11.36   0.000    -.2815671   -.1987029
-------------+----------------------------------------------------------------
       /cut1 |  -.1757122   .0333944                      -.241164   -.1102604
       /cut2 |   1.389459    .033518                      1.323765    1.455153
       /cut3 |   2.998987   .0341164                       2.93212    3.065854
       /cut4 |   4.337672   .0365548                      4.266026    4.409318
------------------------------------------------------------------------------

. 
. 
. *-------------

. * Question 5

. *-------------

. * Part A

. * Noncompliers (i.e. people who are not currently evacuated) vs. compliers (i.e. people who 
> are still evacuated) in 2006

. * Noncompliers (i.e. people who are not currently evacuated) vs. compliers (i.e. people who 
> are still evacuated) in 2006

. * Split evacpost into two variables: complier*post and noncomplier*post

. * complier*post = evacnow

. * noncomplier = 1 when denier and backhome are 1

. gen noncomplier=1 if denier==1 | backhome==1
(109722 missing values generated)

. replace noncomplier=0 if denier==0 & backhome==0
(109722 real changes made)

. reg wkswork noncomplier evacnow year everevac

      Source |       SS       df       MS              Number of obs =  110011
-------------+------------------------------           F(  4,110006) =   17.27
       Model |  30780.6526     4  7695.16315           Prob > F      =  0.0000
    Residual |  49019652.3110006  445.608897           R-squared     =  0.0006
-------------+------------------------------           Adj R-squared =  0.0006
       Total |    49050433110010  445.872493           Root MSE      =  21.109

------------------------------------------------------------------------------
     wkswork |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 noncomplier |  -.8645684   1.811282    -0.48   0.633    -4.414656    2.685519
     evacnow |  -10.21451   2.516496    -4.06   0.000    -15.14681   -5.282218
        year |   .7158863   .1354504     5.29   0.000     .4504055    .9813671
    everevac |  -2.172354   1.316335    -1.65   0.099     -4.75235    .4076432
       _cons |  -1397.114   271.6684    -5.14   0.000     -1929.58    -864.648
------------------------------------------------------------------------------

. 
. regress wkswork noncomplier evacnow after_storm everevac age black sex hsgrad someco ba post
> grad, robust

Linear regression                                      Number of obs =  110011
                                                       F( 11,109999) = 1005.61
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0922
                                                       Root MSE      =  20.119

------------------------------------------------------------------------------
             |               Robust
     wkswork |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 noncomplier |  -.1833354   1.828354    -0.10   0.920    -3.766883    3.400212
     evacnow |  -9.675246   2.532699    -3.82   0.000     -14.6393   -4.711193
 after_storm |   .5744495    .129686     4.43   0.000     .3202669    .8286322
    everevac |  -1.402325   1.340607    -1.05   0.296    -4.029895    1.225245
         age |    -.27342    .005857   -46.68   0.000    -.2848997   -.2619403
       black |  -1.442941   .2238108    -6.45   0.000    -1.881607   -1.004275
         sex |  -7.722379   .1209377   -63.85   0.000    -7.959416   -7.485343
      hsgrad |   8.686394   .2382219    36.46   0.000     8.219483    9.153306
      someco |   2.745513   .1614576    17.00   0.000     2.429059    3.061968
          ba |   1.689371   .1676351    10.08   0.000     1.360808    2.017933
    postgrad |   1.604378   .2051782     7.82   0.000     1.202232    2.006525
       _cons |   52.34616   .3704374   141.31   0.000     51.62011    53.07221
------------------------------------------------------------------------------

. regress earnings noncomplier evacnow after_storm everevac age black sex hsgrad someco ba pos
> tgrad, robust

Linear regression                                      Number of obs =  110011
                                                       F( 11,109999) = 1169.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1490
                                                       Root MSE      =   41417

------------------------------------------------------------------------------
             |               Robust
    earnings |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 noncomplier |  -902.1256   2416.017    -0.37   0.709    -5637.485    3833.234
     evacnow |  -7476.259   2804.015    -2.67   0.008    -12972.09    -1980.43
 after_storm |   827.4684   265.0861     3.12   0.002     307.9034    1347.033
    everevac |   -3800.67    1952.13    -1.95   0.052    -7626.817    25.47737
         age |  -21.51447   10.22401    -2.10   0.035    -41.55339   -1.475544
       black |  -3217.866   305.3856   -10.54   0.000    -3816.417   -2619.314
         sex |  -19241.66   253.2237   -75.99   0.000    -19737.97   -18745.34
      hsgrad |   9883.548   246.0751    40.16   0.000     9401.245    10365.85
      someco |   6928.722   237.4627    29.18   0.000     6463.299    7394.146
          ba |   14907.08   398.5169    37.41   0.000     14125.99    15688.17
    postgrad |   19279.58    807.113    23.89   0.000     17697.65    20861.51
       _cons |   42713.28   608.2692    70.22   0.000     41521.08    43905.47
------------------------------------------------------------------------------

. regress unempinc noncomplier evacnow after_storm everevac age black sex hsgrad someco ba pos
> tgrad, robust

Linear regression                                      Number of obs =  110011
                                                       F( 11,109999) =   14.80
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0016
                                                       Root MSE      =  1160.7

------------------------------------------------------------------------------
             |               Robust
    unempinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 noncomplier |    95.1434   37.58225     2.53   0.011     21.48273    168.8041
     evacnow |   171.7557   95.53515     1.80   0.072    -15.49181    359.0032
 after_storm |  -14.23139   7.781559    -1.83   0.067    -29.48314    1.020349
    everevac |   -119.106   20.91385    -5.70   0.000    -160.0968   -78.11513
         age |  -.1855881   .3030114    -0.61   0.540    -.7794861    .4083099
       black |   36.16436   15.18852     2.38   0.017     6.395086    65.93363
         sex |  -73.01037   7.184395   -10.16   0.000    -87.09168   -58.92906
      hsgrad |   17.18624   12.88991     1.33   0.182     -8.07779    42.45028
      someco |   14.25696   9.644811     1.48   0.139    -4.646726    33.16065
          ba |  -54.51079   9.858208    -5.53   0.000    -73.83273   -35.18884
    postgrad |  -23.63981   11.85286    -1.99   0.046    -46.87125   -.4083775
       _cons |   253.9951   20.30215    12.51   0.000     214.2032    293.7871
------------------------------------------------------------------------------

. ologit health noncomplier evacnow after_storm everevac black sex hsgrad someco ba postgrad, 
> robust

Iteration 0:   log pseudolikelihood =  -154284.5  
Iteration 1:   log pseudolikelihood = -150232.49  
Iteration 2:   log pseudolikelihood = -150211.15  
Iteration 3:   log pseudolikelihood = -150211.14  

Ordered logistic regression                       Number of obs   =     110011
                                                  Wald chi2(10)   =    7699.35
                                                  Prob > chi2     =     0.0000
Log pseudolikelihood = -150211.14                 Pseudo R2       =     0.0264

------------------------------------------------------------------------------
             |               Robust
      health |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 noncomplier |  -.1665407   .1642081    -1.01   0.310    -.4883826    .1553013
     evacnow |   .0200587   .2713692     0.07   0.941     -.511815    .5519325
 after_storm |  -.0207707   .0116873    -1.78   0.076    -.0436774    .0021359
    everevac |   .2382017   .1173995     2.03   0.042     .0081028    .4683005
       black |   .3914133   .0196192    19.95   0.000     .3529604    .4298662
         sex |   .1025042   .0110115     9.31   0.000      .080922    .1240864
      hsgrad |  -.6090186   .0205737   -29.60   0.000    -.6493423   -.5686949
      someco |  -.3477724   .0143001   -24.32   0.000    -.3758002   -.3197446
          ba |  -.5139647   .0158383   -32.45   0.000    -.5450072   -.4829222
    postgrad |  -.1246237   .0207313    -6.01   0.000    -.1652564   -.0839911
-------------+----------------------------------------------------------------
       /cut1 |  -1.730705   .0261756                     -1.782009   -1.679402
       /cut2 |  -.2159715   .0255834                      -.266114   -.1658291
       /cut3 |   1.344643   .0260407                      1.293604    1.395681
       /cut4 |   2.657667   .0292304                      2.600377    2.714958
------------------------------------------------------------------------------

. tabulate evacnow everevac if year==2006

           |       everevac
   evacnow |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,957        289 |    73,246 
         1 |         0         97 |        97 
-----------+----------------------+----------
     Total |    72,957        386 |    73,343 


. regress evacnow everevac if year==2006

      Source |       SS       df       MS              Number of obs =   73343
-------------+------------------------------           F(  1, 73341) =24486.63
       Model |    24.24736     1    24.24736           Prob > F      =  0.0000
    Residual |  72.6243523 73341  .000990229           R-squared     =  0.2503
-------------+------------------------------           Adj R-squared =  0.2503
       Total |  96.8717124 73342  .001320822           Root MSE      =  .03147

------------------------------------------------------------------------------
     evacnow |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    everevac |   .2512953   .0016059   156.48   0.000     .2481478    .2544429
       _cons |   2.91e-17   .0001165     0.00   1.000    -.0002283    .0002283
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/andrew/Desktop/PS2 Stata log.log
  log type:  text
 closed on:  30 Sep 2013, 22:20:49
----------------------------------------------------------------------------------------------
