----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrew/Desktop/PS3 Stata log.log
  log type:  text
 opened on:  15 Oct 2013, 22:25:40

. cd "~/Documents/Duke 2013-2014/Fall 2013/PubPol 604/Problem set 3/"
/Users/andrew/Documents/Duke 2013-2014/Fall 2013/PubPol 604/Problem set 3

. use "PS3.dta", clear

. gen complier = (avgrow05 > 0 & expgrow == 1) | (avgrow05 <= 0 & expgrow == 0)

. gen growth = avgrow05 > 0

. tabulate growth expgrow, chi2 column cchi2

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| chi2 contribution |
| column percentage |
+-------------------+

           | Made expected growth
    growth |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,033         23 |     1,056 
           |     592.9      518.4 |    1111.3 
           |     99.04       1.93 |     47.23 
-----------+----------------------+----------
         1 |        10      1,170 |     1,180 
           |     530.6      463.9 |     994.5 
           |      0.96      98.07 |     52.77 
-----------+----------------------+----------
     Total |     1,043      1,193 |     2,236 
           |    1123.5      982.2 |    2105.8 
           |    100.00     100.00 |    100.00 

          Pearson chi2(1) =  2.1e+03   Pr = 0.000

. bootstrap, rep(100) : rd avgrow06 expgrow avgrow05
(running rd on estimation sample)
A predicted value of treatment at cutoff lies outside feasible range;
switching to local mean smoothing for treatment discontinuity.
A predicted value of treatment at cutoff lies outside feasible range;
switching to local mean smoothing for treatment discontinuity.

Bootstrap replications (100)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
xxxx.xxxxxx.xxxxxxxx.x.xxxx.xxxx....xxxx.xx.xxxxxx    50
xxxx.xxxxxxx.xxxxxxxxx.xxxxxxxxx.xxxxxxxxxxxxxxxxx   100
------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
    avgrow06 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       numer |  -.0101027   .0165404    -0.61   0.541    -.0425213    .0223159
       denom |   .9941154   .0038278   259.71   0.000     .9866131    1.001618
       lwald |  -.0101625   .0166923    -0.61   0.543    -.0428787    .0225537
     numer50 |  -.0136906   .0164704    -0.83   0.406     -.045972    .0185909
     denom50 |   .9998175   .0027705   360.88   0.000     .9943875    1.005248
     lwald50 |  -.0136931   .0165376    -0.83   0.408    -.0461061      .01872
    numer200 |  -.0172137   .0138569    -1.24   0.214    -.0443727    .0099452
    denom200 |   .9976339   .0027083   368.36   0.000     .9923257    1.002942
    lwald200 |  -.0172546   .0139986    -1.23   0.218    -.0446913    .0101822
------------------------------------------------------------------------------

. rd avgrow06 expgrow avgrow05, graph bdep
Three variables specified; jump in treatment  
at Z=0 will be estimated. Local Wald Estimate
is the ratio of jump in outcome to jump in treatment.

 Assignment variable Z is avgrow05
 Treatment variable X_T is expgrow
 Outcome variable y is avgrow06

Command used for graph: lpoly; Kernel used: triangle (default)
Bandwidth: .06096044; loc Wald Estimate: -.01005304
Bandwidth: .03048022; loc Wald Estimate: -.01367047
Bandwidth: .12192088; loc Wald Estimate: -.01725457
(177 missing values generated)
(177 missing values generated)
(177 missing values generated)
Estimating for bandwidth .0609604377684203
A predicted value of treatment at cutoff lies outside feasible range;
switching to local mean smoothing for treatment discontinuity.
Estimating for bandwidth .0304802188842101
A predicted value of treatment at cutoff lies outside feasible range;
switching to local mean smoothing for treatment discontinuity.
Estimating for bandwidth .1219208755368406
------------------------------------------------------------------------------
    avgrow06 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       numer |  -.0101027   .0166895    -0.61   0.545    -.0428135    .0226081
       denom |   .9941154   .0034005   292.35   0.000     .9874506     1.00078
       lwald |  -.0101625   .0167872    -0.61   0.545    -.0430648    .0227397
     numer50 |  -.0136906   .0272675    -0.50   0.616    -.0671339    .0397527
     denom50 |   .9998175   .0001832  5456.46   0.000     .9994584    1.000177
     lwald50 |  -.0136931   .0272725    -0.50   0.616    -.0671462      .03976
    numer200 |  -.0172137   .0179869    -0.96   0.339    -.0524675      .01804
    denom200 |   .9976339   .0041561   240.04   0.000     .9894881     1.00578
    lwald200 |  -.0172546   .0180422    -0.96   0.339    -.0526166    .0181075
------------------------------------------------------------------------------

. scatter enroll avgrow05

. scatter pblack avgrow05

. scatter phisp avgrow05

. scatter pfrl avgrow05

. gen avgrow05_2 = avgrow05^2

. gen avgrow05_3 = avgrow05^3

. gen avgrow05_4 = avgrow05^4

. reg avgrow06 avgrow05 avgrow05_2 avgrow05_3 pblack phisp pfrl enroll elemschl midschl highsc
> hl expgrow

      Source |       SS       df       MS              Number of obs =    1660
-------------+------------------------------           F( 11,  1648) =    4.50
       Model |  10.2462343    11  .931475848           Prob > F      =  0.0000
    Residual |  341.024898  1648  .206932584           R-squared     =  0.0292
-------------+------------------------------           Adj R-squared =  0.0227
       Total |  351.271132  1659  .211736668           Root MSE      =   .4549

------------------------------------------------------------------------------
    avgrow06 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    avgrow05 |  -.1096921   .1688927    -0.65   0.516     -.440959    .2215747
  avgrow05_2 |  -.2138755   .3414322    -0.63   0.531    -.8835622    .4558112
  avgrow05_3 |  -.5416002   .6041381    -0.90   0.370    -1.726559    .6433591
      pblack |   -.036786   .0592504    -0.62   0.535    -.1530001     .079428
       phisp |   .0760496   .1408245     0.54   0.589    -.2001643    .3522634
        pfrl |  -.1414547   .0864587    -1.64   0.102    -.3110351    .0281258
      enroll |  -.0000624   .0000598    -1.04   0.297    -.0001796    .0000549
    elemschl |  -.0366051   .0328093    -1.12   0.265    -.1009575    .0277473
     midschl |  -.0308444   .0411184    -0.75   0.453    -.1114943    .0498055
    highschl |   .0253123   .0490969     0.52   0.606    -.0709866    .1216113
     expgrow |   .1228873   .0346467     3.55   0.000     .0549311    .1908435
       _cons |   .1233842   .0549892     2.24   0.025      .015528    .2312403
------------------------------------------------------------------------------

. reg avgrow06 c.avgrow05##c.avgrow05##c.avgrow05 pblack phisp pfrl enroll elemschl midschl hi
> ghschl expgrow

      Source |       SS       df       MS              Number of obs =    1660
-------------+------------------------------           F( 11,  1648) =    4.50
       Model |  10.2462342    11  .931475837           Prob > F      =  0.0000
    Residual |  341.024898  1648  .206932584           R-squared     =  0.0292
-------------+------------------------------           Adj R-squared =  0.0227
       Total |  351.271132  1659  .211736668           Root MSE      =   .4549

----------------------------------------------------------------------------------------
              avgrow06 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
              avgrow05 |  -.1096922   .1688927    -0.65   0.516     -.440959    .2215747
                       |
 c.avgrow05#c.avgrow05 |  -.2138756   .3414322    -0.63   0.531    -.8835623    .4558112
                       |
 c.avgrow05#c.avgrow05#|
            c.avgrow05 |     -.5416   .6041381    -0.90   0.370    -1.726559    .6433592
                       |
                pblack |   -.036786   .0592504    -0.62   0.535    -.1530001     .079428
                 phisp |   .0760496   .1408245     0.54   0.589    -.2001643    .3522634
                  pfrl |  -.1414547   .0864587    -1.64   0.102    -.3110351    .0281258
                enroll |  -.0000624   .0000598    -1.04   0.297    -.0001796    .0000549
              elemschl |  -.0366051   .0328093    -1.12   0.265    -.1009575    .0277473
               midschl |  -.0308444   .0411184    -0.75   0.453    -.1114943    .0498055
              highschl |   .0253123   .0490969     0.52   0.606    -.0709866    .1216113
               expgrow |   .1228873   .0346467     3.55   0.000     .0549311    .1908435
                 _cons |   .1233842   .0549892     2.24   0.025      .015528    .2312403
----------------------------------------------------------------------------------------

. reg avgrow06 avgrow05 avgrow05_2 avgrow05_3 expgrow

      Source |       SS       df       MS              Number of obs =    2059
-------------+------------------------------           F(  4,  2054) =   11.30
       Model |  8.14407326     4  2.03601832           Prob > F      =  0.0000
    Residual |  370.173538  2054  .180220807           R-squared     =  0.0215
-------------+------------------------------           Adj R-squared =  0.0196
       Total |  378.317611  2058  .183827799           Root MSE      =  .42452

------------------------------------------------------------------------------
    avgrow06 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    avgrow05 |   .0967478   .1383004     0.70   0.484    -.1744758    .3679714
  avgrow05_2 |  -.0146996   .2786531    -0.05   0.958    -.5611717    .5317724
  avgrow05_3 |  -.9667129   .5231082    -1.85   0.065    -1.992591    .0591649
     expgrow |   .1032844   .0288129     3.58   0.000     .0467788    .1597899
       _cons |   .0061473   .0176678     0.35   0.728    -.0285014     .040796
------------------------------------------------------------------------------

. reg avgrow06 avgrow05 avgrow05_2 pblack phisp pfrl enroll elemschl midschl highschl expgrow

      Source |       SS       df       MS              Number of obs =    1660
-------------+------------------------------           F( 10,  1649) =    4.87
       Model |   10.079926    10   1.0079926           Prob > F      =  0.0000
    Residual |  341.191206  1649  .206907948           R-squared     =  0.0287
-------------+------------------------------           Adj R-squared =  0.0228
       Total |  351.271132  1659  .211736668           Root MSE      =  .45487

------------------------------------------------------------------------------
    avgrow06 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    avgrow05 |  -.2096638   .1268352    -1.65   0.099    -.4584388    .0391113
  avgrow05_2 |  -.4085045   .2635037    -1.55   0.121    -.9253416    .1083327
      pblack |  -.0350902   .0592167    -0.59   0.554    -.1512381    .0810576
       phisp |   .0768005   .1408137     0.55   0.586    -.1993919    .3529929
        pfrl |   -.147272   .0862097    -1.71   0.088    -.3163641      .02182
      enroll |  -.0000677   .0000595    -1.14   0.255    -.0001844    .0000489
    elemschl |  -.0362353   .0328048    -1.10   0.270    -.1005787    .0281081
     midschl |  -.0303833   .0411128    -0.74   0.460    -.1110221    .0502554
    highschl |   .0299017   .0488264     0.61   0.540    -.0658666      .12567
     expgrow |   .1373661   .0306503     4.48   0.000     .0772486    .1974836
       _cons |   .1226501   .0549799     2.23   0.026     .0148124    .2304878
------------------------------------------------------------------------------

. reg avgrow06 avgrow05 avgrow05_2 avgrow05_3 avgrow05_4 pblack phisp pfrl enroll elemschl mid
> schl highschl expgrow

      Source |       SS       df       MS              Number of obs =    1660
-------------+------------------------------           F( 12,  1647) =    5.07
       Model |  12.5037214    12  1.04197678           Prob > F      =  0.0000
    Residual |  338.767411  1647   .20568756           R-squared     =  0.0356
-------------+------------------------------           Adj R-squared =  0.0286
       Total |  351.271132  1659  .211736668           Root MSE      =  .45353

------------------------------------------------------------------------------
    avgrow06 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    avgrow05 |   .2646263   .2027792     1.30   0.192     -.133106    .6623585
  avgrow05_2 |  -1.476102   .5109189    -2.89   0.004    -2.478221   -.4739832
  avgrow05_3 |  -3.142643   .9895495    -3.18   0.002    -5.083551   -1.201735
  avgrow05_4 |   4.507684   1.360645     3.31   0.001     1.838908    7.176461
      pblack |  -.0306911   .0591006    -0.52   0.604    -.1466112    .0852291
       phisp |   .0645771   .1404429     0.46   0.646    -.2108885    .3400426
        pfrl |  -.1217652   .0864029    -1.41   0.159    -.2912362    .0477059
      enroll |  -.0000648   .0000596    -1.09   0.277    -.0001817    .0000521
    elemschl |  -.0408823    .032736    -1.25   0.212    -.1050907    .0233262
     midschl |  -.0366388   .0410318    -0.89   0.372    -.1171189    .0438413
    highschl |    .032151   .0489925     0.66   0.512    -.0639432    .1282452
     expgrow |   .0766534    .037255     2.06   0.040     .0035813    .1497256
       _cons |      .1539    .055592     2.77   0.006     .0448616    .2629384
------------------------------------------------------------------------------

. reg avgrow06 avgrow05 avgrow05_2 avgrow05_3 pblack phisp pfrl enroll expgrow if elemschl == 
> 1

      Source |       SS       df       MS              Number of obs =     945
-------------+------------------------------           F(  8,   936) =   66.08
       Model |  4.61529646     8  .576912057           Prob > F      =  0.0000
    Residual |  8.17199079   936  .008730759           R-squared     =  0.3609
-------------+------------------------------           Adj R-squared =  0.3555
       Total |  12.7872872   944  .013545855           Root MSE      =  .09344

------------------------------------------------------------------------------
    avgrow06 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    avgrow05 |   .5631434   .0782357     7.20   0.000     .4096056    .7166811
  avgrow05_2 |   .5238998   .2135149     2.45   0.014     .1048766    .9429231
  avgrow05_3 |  -.9498007   1.048422    -0.91   0.365     -3.00733    1.107729
      pblack |  -.0675657   .0165681    -4.08   0.000    -.1000806   -.0350507
       phisp |   .0689313   .0356763     1.93   0.054    -.0010835    .1389461
        pfrl |  -.0864217   .0248813    -3.47   0.001    -.1352513   -.0375922
      enroll |  -.0000131   .0000192    -0.68   0.494    -.0000508    .0000245
     expgrow |   -.012171   .0118743    -1.02   0.306    -.0354744    .0111324
       _cons |   .1070527   .0161225     6.64   0.000     .0754122    .1386931
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  /Users/andrew/Desktop/PS3 Stata log.log
  log type:  text
 closed on:  15 Oct 2013, 22:27:04
----------------------------------------------------------------------------------------------
